<h2>&Uuml;ber diese Anwendung</h2>
<p>Diese Anwendung soll dem Benutzer helfen, die Definitionen zu lernen, welche ihm in der Grundausbildung als Polizeikommissaranw&auml;rter in Baden-W&uuml;rttemberg begegnen.<br />Alle Definitionen sind nach Fachbereich und Fach sortiert wie sie zum Stand 2022 existieren.<br />Weiterhin beitzt jede Definition ein &lsquo;Skill-Level&rsquo; um gezielter Definitionen abzufragen, welche der Benutzer weniger gut beherrscht.</p>
<p>Diese Anwendung hebt keinen Anspruch auf Vollstandigkeit. Deswegen ist es m&ouml;glich, eigene Definitionen der pers&ouml;nlichen Sammlung hinzuzuf&uuml;gen oder ggf. wieder zu l&ouml;schen.</p>
<p>Des Weiteren erhebt die Anwendung keinen Anspruch auf Korrektheit.<br />Falls grobe Fehler, Bugs oder Fragen auftreten einfach eine Nachricht an folgende Mail-Adresse: <a href="mailto:davidlangsam512@gmail.com">davidlangsam512@gmail.com</a></p>
<h3><span style="text-decoration: underline;">Datenschutzerkl&auml;rung</span></h3>
<h4>Verantwortlicher</h4>
<p>Paul David Langsam<br />4415 K-IT Sturmb&uuml;hlstra&szlig;e 250<br />78054 Villingen-Schwenningen</p>
<h4>Erhobene Daten</h4>
<ul>
    <li>Speicherzugriff: Die Anwendung greift auf den Speicher des Ger&auml;tes zu. Dies dient dem Abspeichern und Aufrufen von Definitionen und Einstellungen. Dies Speicherung besteht dauerhaft bis zur Deinstallation der Anwendung.</li>
    <li>Weiteres: Es werden keine weiteren pers&ouml;nlichen Daten erhoben. Eine Weitergabe von Daten an Dritte findet nicht statt.</li>
    <li>Siehe auch: <a href="https://datenschutzerklarung-definitionstrainer.webflow.io/">https://datenschutzerklarung-definitionstrainer.webflow.io/</a></li>
</ul>
<h3><span style="text-decoration: underline;">Anmerkungen zur Anwendung</span></h3>
<h4>Anmerkungen zum Zufallsalgorithmus</h4>
<p>Es wird unterschieden zwischen erlernten, zu erlernenden und unbekannten Definitionen. Bei jeder Abfrage nimmt der Algorithmus zwei erlernte (zuf&auml;llig) und f&uuml;nf zu erlernende Definitionen (fest). Hiervon nimmt er dann eine zuf&auml;llig. Wird eine Definition beherrscht (Skill = 10). Dann wechselt sie von 'zu erlernen' zu 'erlernt' und die n&auml;chste unbekannte Definition r&uuml;ckt in den 'zu erlernenden'-Status nach.<br />Der Nutzer wird also zeitgleich maximal mit 5 zu erlernenden Definitionen konfrontiert und 'gr&auml;bt' sich beim &Uuml;ben durch den Stapel. Wenn am Ende alle Definitionen einen Skill von 10 haben, ist die Selektion echt zuf&auml;llig (Wiederholungen sind m&ouml;glich).</p>
<h4>Anmerkung zu 'Favoriten'</h4>
<p>In der 'Suchfuktion' k&ouml;nnen Definitionen durch das Setzen von H&auml;kchen favorisiert werden. Die Favoriten k&ouml;nnen anschlie&szlig;end gezielt gelernt werden, indem man in der Fachbereichauswahl auf 'Favoriten' klickt. Um sich in der Suchfunktion alle favorisierten Definitionen anzeigen zu lassen, kann man 'Favoriten' in das Suchfeld eingeben."</p>